test.yml
# my-scenario.yml
config:
  payload:
    path: "data.csv"
    fields:
      - "username"
  target: "http://192.168.219.102:8080"
  phases:
    - duration: 1 # 몇 초 동안 테스트 할것인지
      arrivalRate: 1 # 1초당 몇 명의 부하를 줄 것인지
  engines:
   socketio-v3: {}

scenarios:
  - name: My sample scenario
    engine: socketio-v3
    flow:
      # 첫 화면
      - emit:
          channel: "none"
          data: 
            "line": "load"
            "user": "{}"

      # 로그인 선택
      - emit:
          channel: "front"
          data: 
            "line": "in"

      # 아이디 입력
      - emit:
          channel: "sign"
          data:
            "line": "{{ username }}"
            "user": {}
            "option": "20"

      # 비밀번호 입력
      - emit:
          channel: "sign"
          data: 
            "line": "1234"
            "user": {"username": "{{ username }}"}
            "option": "21"

      # 던전 입장 선택
      - emit:
          channel: "front"
          data: 
            "line": "d"
            "user": {"username": "{{ username }}"}

      # # 던전 난이도 선택
      # - emit:
      #     channel: "dungeon"
      #     data: 
      #       "line": "입장 1"
      #       "user": {"username": "{{ username }}"}

      # # 전투 빙식 선택
      # - emit:
      #     channel: "battle"
      #     data: 
      #       "line": "수동"
      #       "user": {"username": "{{ username }}"}

      # # 수동 or 자동 선택
      # - emit:
      #     channel: "encounter"
      #     data: 
      #       "line": "공격"
      #       "user": {"username": "{{ username }}"}
            
      # 10초 동안 아무것도 하지 않은 다음 연결 해제
      - think: 15




# 로드 테스트 로그 파일 명령어 npx artillery run -o test-report test.yml
# 로그 테스트 html view - npx artillery report test-report && npx artillery run --output test-report.json test.yml

# 로드 테스트 실행 명령어 npx artillery run test.yml